Autodesk.Revit.DB.ElementId.op_GreaterThanOrEqual(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Determines whether one element id is not less than another element id.
elementId1: The first ElementId.
elementId2: The second ElementId.
Returns: True if the first element id is not less than the second element id, otherwise, false.

Autodesk.Revit.DB.ElementId.op_LessThanOrEqual(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Determines whether one element id is not greater than another element id.
elementId1: The first ElementId.
elementId2: The second ElementId.
Returns: True if the first element id is not greater than the second element id, otherwise, false.

Autodesk.Revit.DB.ElementId.op_GreaterThan(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Determines whether one element id is greater than another element id.
elementId1: The first ElementId.
elementId2: The second ElementId.
Returns: True if the first element id is greater than the second element id, otherwise, false.

Autodesk.Revit.DB.ElementId.op_LessThan(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Determines whether this element id is less than another element id.
elementId1: The first ElementId.
elementId2: The second ElementId.
Returns: True if the first element id is less than the second element id, otherwise, false.

Autodesk.Revit.DB.ElementId.op_Inequality(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Determines whether these two ElementIds are different.
first: The first ElementId.
second: The second ElementId.
Returns: True if the ElementIds are different; otherwise, false.

Autodesk.Revit.DB.ElementId.op_Equality(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Determines whether these two ElementIds are the same.
first: The first ElementId.
second: The second ElementId.
Returns: True if the ElementIds are the same; otherwise, false.

Autodesk.Revit.DB.ElementId.Compare(Autodesk.Revit.DB.ElementId)
Compares two element ids.
id: The ElementId to be compared with this ElementId.
Returns: -1 if this element id is less than id, 0 if equal, 1 if greater.

Autodesk.Revit.DB.ElementId.InvalidElementId
Get the invalid ElementId whose IntegerValue is -1.

Autodesk.Revit.DB.ElementId.GetHashCode
Gets the integer value of the id as hash code

Autodesk.Revit.DB.ElementId.Equals(System.Object)
Determines whether the specified System.Object is equal to the current System.Object.
obj:  Another object.

Autodesk.Revit.DB.ElementId.ToString
Gets a String representation of the integer value of the id.

Autodesk.Revit.DB.ElementId.IntegerValue
Provides the value of the element id as an integer.

Autodesk.Revit.DB.ElementId.#ctor(Autodesk.Revit.DB.BuiltInParameter)
Create an ElementId handle with the given BuiltInParameter id.
parameterId: The id.

Autodesk.Revit.DB.ElementId.#ctor(Autodesk.Revit.DB.BuiltInCategory)
Create an ElementId handle with the given BuiltInCategory id.
categoryId: The id.

Autodesk.Revit.DB.ElementId.#ctor(System.Int32)
Create an ElementId handle with the given integer id.
id: The id.

Autodesk.Revit.DB.ElementId
The ElementId object is used as a unique identification for an element within a
single project.
Remarks: The Value within the ElementId is only unique with a single project. It is not unique
across several projects. The Id can be used to retrieve a specific element from the database
when needed. However ids are subject to change during an Autodesk Revit session and as such
should not be retained and used across repeated calls to external commands. If a manner is
needed to uniquely identify an element beyond this limitation then a shared parameter should
be added to the element containing a unique identifier managed by the external application.